Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/alternative_repayment_arrangements.html.txt.tmx
Source language: en
Languages: ga

source: Under the national mortgage-to-rent scheme, people who are having trouble paying their mortgages to private lenders can switch from owning their home to renting their home as social tenants
ga: Faoin scéim cíos in ionad morgáiste, féadfaidh daoine a bhfuil deacrachtaí acu a morgáistí a íoc le hiasachtóirí príobháideacha aistriú ó úinéireacht a bheith acu ar a dteach go dtí a dteach a ligean ar cíos mar thionóntaí sóisialacha

source: If you take up the mortgage-to-rent option, you will no longer own your home or have any financial interest in it
ga: Má ghlacann tú leis an rogha um morgáiste-chuig-cíos, ní bheidh úinéireacht agat ar do theach a thuilleadh ná aon leas airgeadais ann

source: • Voluntary sale of the property
ga: • Díol deonach na réadmhaoine

source: You sell the property yourself
ga: Íocann tú an réadmhaoin tú féin

source: Your lender must also inform you in writing that you are now outside the MARP, and that repossession proceedings can follow either 3 months from the date the letter is issued or 8 months from the date your arrears arose, whichever date is later
ga: Ní mór do d’iasachtóir thú a chur ar an eolas i scríbhinn, chomh maith, go bhfuil tú anois lasmuigh den PRRM, agus gur féidir dul i mbun imeachtaí athshealbhaithe cibé acu 3 mhí ón dáta a eisítear an litir nó 8 mí i ndiaidh an dáta a cruthaíodh do riaráistí, pé dáta is déanaí

source: You must be told about personal insolvency options, the importance of taking independent advice and your right to appeal or complain
ga: Ní mór thú a chur ar an eolas faoi roghanna dócmhainneachta pearsanta, an tábhacht a bhaineann le comhairle neamhspleách a fháil agus an ceart atá agat chun achomharc nó chun gearán a dhéanamh

source: You can read our document on the MARP to get more detailed information on what happens if an alternative repayment arrangement is not agreed or if you break an alternative repayment arrangement
ga: Féadfaidh tú ár gcáipéis ar an PRRM a léamh chun faisnéis níos mionsonraithe a fháil ar cad a tharlaíonn mura ndéantar comhaontú ar shocrú malartach aisíocaíochta nó má sháraíonn tú socrú malartach aisíocaíochta

source: Remember that, if you and your lender cannot come to an agreement on modifying or restructuring your mortgage, you can also consider a Personal Insolvency Arrangement (PIA)
ga: Cuimhnigh, murar féidir leat féin agus d’iasachtóir comhaontú a bhaint amach ar do mhorgáiste a mhionathrú nó do mhorgáiste a athstruchtúrú, féadfaidh tú breithniú a dhéanamh, chomh maith ar Shocrú Dócmhainneachta Pearsanta (SDP)

source: Under a PIA all of your debts, including your mortgage, are assessed and an agreed plan is made to repay your creditors
ga: Faoi SDP, déantar measúnú ar d’fhiachais go léir, do mhorgáiste san áireamh, agus cuirtear plean comhaontaithe i dtoll a chéile chun aisíocaíocht a dhéanamh le do chreidiúnaithe

source: A PIA will need to be approved at a creditors’ meeting (by a qualified majority of creditors). You also can get more information on this option from backontrack.ie
ga: Beidh faomhadh le déanamh ar SDP ag cruinniú creidiúnaithe (ag tromlach cáilithe do chuid creidiúnaithe)

source: If you are in very serious financial difficulties, bankruptcy may also be an option
ga: Ina theannta sin, féadfaidh tú tuilleadh faisnéise a fháil faoin rogha seó ó backontrack.ie Má tá deacrachtaí an-tromchúiseacha airgeadais agat, b’fhéidir gur rogha a bheidh i bhféimheacht, chomh maith
